const data=[
    {
        h3:"Введение в операционные системы",
        p:"Основные функции ОС, история и развитие, типы ОС",
        Link: "introduction"
    },
    {
        h3:"Процессы и потоки",
        p:"Понятия процессов и потоков, управление процессами, планирование и приоритеты.",
        Link: "processes-and-threads"
    },
    {
        h3:"Управление памятью",
        p:"Механизмы распределения памяти, виртуальная память, страничная и сегментная организация",
        Link: "imemory-management"
    },
    {
        h3:"Файловые системы",
        p:"Структура и организация файловых систем, методы доступа к данным, управление файловой системой",
        Link: "file-systems"
    },
    {
        h3:"Ввод/вывод и драйверы устройств",
        p:"Аппаратные и программные аспекты ввода/вывода, драйверы устройств.",
        Link: "io-systems-and-drivers"
    },
    {
        h3:"Безопасность и защита",
        p:"Основы безопасности ОС, методы аутентификации, управление доступом, защита данных",
        Link: "security-and-protection"
    },
    {
        h3:"Сетевые операционные системы",
        p:"Основы сетевых взаимодействий, протоколы, сетевые службы",
        Link: "network-os"
    },
    {
        h3:"Виртуализация",
        p:"Концепции виртуальных машин, гипервизоры, преимущества виртуализации",
        Link: "virtualization"
    },
    {
        h3:"Реальные операционные системы",
        p:"Особенности ОС реального времени, управление ресурсами и временем выполнения задач.",
        Link: "real-time-os"
    },
    {
        h3:"Обработка прерываний и системных вызовов",
        p:"Механизмы обработки прерываний, системные вызовы и их роль",
        Link: "interrupts-and-system-calls"
    },
    {
        h3:"Мультиплатформенные и встраиваемые операционные системы",
        p:"ОС для различных архитектур, особенности мобильных и встраиваемых систем",
        Link: "multiplatform-and-embedded-os"
    },
    {
        h3:"Оптимизация производительности",
        p:"Методы повышения эффективности работы ОС, управление энергопотреблением.",
        Link: "performance-optimization"
    },
    {
        h3:"Разработка и отладка ОС",
        p:"Основы создания операционных систем, методы отладки и тестирования",
        Link: "os-development-and-debugging"
    }
    
]
export default data